ninety-nine-cats/app/controllers/cats_controller.rb

    def show
        @cat = Cats.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]